papers/tsg-11-integrity.html
---
comments: true
layout: page
title: Integrity Data Attacks in Power Market Operations
---
<hr />

<p>
<b>Le Xie, Yilin Mo and Bruno Sinopoli</b>
</p>

<p>
<i>IEEE Transactions on Smart Grid</i>, Dec 2011, Volume 2, Issue 4, Pages 659-666
</p>

<p>
Link to the <a href="../../../public/papers/j11smartgridestimation.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Fj11smartgridestimation.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-orgf5bc2bb" class="outline-2">
<h2 id="orgf5bc2bb">Abstract</h2>
<div class="outline-text-2" id="text-orgf5bc2bb">
<p>
We study the economic impact of a potential class of integrity cyber attacks, named false data injection attacks, on electric power market operations. In particular, we show that with the knowledge of the transmission system topology, attackers may circumvent the bad data detection algorithms equipped in today's state estimator. This, in turn, may be leveraged by attackers for consistent financial arbitrage such as virtual bidding at selected pairs of nodes. This paper is a first attempt to formalize the economic impact of malicious data attacks on real-time market operations. We show how an attack could systematically construct a profitable attacking strategy, in the meantime being undetected by the system operator. Such a result is also valuable for the system operators to examine the potential economic loss due to such cyber attack. The potential impact of the false data injection attacks is illustrated on real-time market operations of the IEEE 14-bus system.
</p>
</div>
</div>
